# Transparency Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MaterialNode..::..Transparency Property
MaterialNode Class See Also
---
The value of transparency the material is being rendered with
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Transparency { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Transparency As Double
	Get
```

Visual C++
---
```text
public:
property double Transparency {
	double get ();
}
```

# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace